Model: "model_3"
________________________________________________________________________________________________________________________
Layer (type)                              Output Shape                         Param #       Connected to               
========================================================================================================================
input_1 (InputLayer)                      (None, None, None, 3)                0                                        
________________________________________________________________________________________________________________________
zero_padding2d_1 (ZeroPadding2D)          (None, None, None, 3)                0             input_1[0][0]              
________________________________________________________________________________________________________________________
conv1 (Conv2D)                            (None, None, None, 64)               9472          zero_padding2d_1[0][0]     
________________________________________________________________________________________________________________________
bn_conv1 (BatchNormalization)             (None, None, None, 64)               256           conv1[0][0]                
________________________________________________________________________________________________________________________
activation_1 (Activation)                 (None, None, None, 64)               0             bn_conv1[0][0]             
________________________________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)            (None, None, None, 64)               0             activation_1[0][0]         
________________________________________________________________________________________________________________________
res2a_branch2a (Conv2D)                   (None, None, None, 64)               4160          max_pooling2d_1[0][0]      
________________________________________________________________________________________________________________________
bn2a_branch2a (BatchNormalization)        (None, None, None, 64)               256           res2a_branch2a[0][0]       
________________________________________________________________________________________________________________________
activation_2 (Activation)                 (None, None, None, 64)               0             bn2a_branch2a[0][0]        
________________________________________________________________________________________________________________________
res2a_branch2b (Conv2D)                   (None, None, None, 64)               36928         activation_2[0][0]         
________________________________________________________________________________________________________________________
bn2a_branch2b (BatchNormalization)        (None, None, None, 64)               256           res2a_branch2b[0][0]       
________________________________________________________________________________________________________________________
activation_3 (Activation)                 (None, None, None, 64)               0             bn2a_branch2b[0][0]        
________________________________________________________________________________________________________________________
res2a_branch2c (Conv2D)                   (None, None, None, 256)              16640         activation_3[0][0]         
________________________________________________________________________________________________________________________
res2a_branch1 (Conv2D)                    (None, None, None, 256)              16640         max_pooling2d_1[0][0]      
________________________________________________________________________________________________________________________
bn2a_branch2c (BatchNormalization)        (None, None, None, 256)              1024          res2a_branch2c[0][0]       
________________________________________________________________________________________________________________________
bn2a_branch1 (BatchNormalization)         (None, None, None, 256)              1024          res2a_branch1[0][0]        
________________________________________________________________________________________________________________________
add_1 (Add)                               (None, None, None, 256)              0             bn2a_branch2c[0][0]        
                                                                                             bn2a_branch1[0][0]         
________________________________________________________________________________________________________________________
activation_4 (Activation)                 (None, None, None, 256)              0             add_1[0][0]                
________________________________________________________________________________________________________________________
res2b_branch2a (Conv2D)                   (None, None, None, 64)               16448         activation_4[0][0]         
________________________________________________________________________________________________________________________
bn2b_branch2a (BatchNormalization)        (None, None, None, 64)               256           res2b_branch2a[0][0]       
________________________________________________________________________________________________________________________
activation_5 (Activation)                 (None, None, None, 64)               0             bn2b_branch2a[0][0]        
________________________________________________________________________________________________________________________
res2b_branch2b (Conv2D)                   (None, None, None, 64)               36928         activation_5[0][0]         
________________________________________________________________________________________________________________________
bn2b_branch2b (BatchNormalization)        (None, None, None, 64)               256           res2b_branch2b[0][0]       
________________________________________________________________________________________________________________________
activation_6 (Activation)                 (None, None, None, 64)               0             bn2b_branch2b[0][0]        
________________________________________________________________________________________________________________________
res2b_branch2c (Conv2D)                   (None, None, None, 256)              16640         activation_6[0][0]         
________________________________________________________________________________________________________________________
bn2b_branch2c (BatchNormalization)        (None, None, None, 256)              1024          res2b_branch2c[0][0]       
________________________________________________________________________________________________________________________
add_2 (Add)                               (None, None, None, 256)              0             bn2b_branch2c[0][0]        
                                                                                             activation_4[0][0]         
________________________________________________________________________________________________________________________
activation_7 (Activation)                 (None, None, None, 256)              0             add_2[0][0]                
________________________________________________________________________________________________________________________
res2c_branch2a (Conv2D)                   (None, None, None, 64)               16448         activation_7[0][0]         
________________________________________________________________________________________________________________________
bn2c_branch2a (BatchNormalization)        (None, None, None, 64)               256           res2c_branch2a[0][0]       
________________________________________________________________________________________________________________________
activation_8 (Activation)                 (None, None, None, 64)               0             bn2c_branch2a[0][0]        
________________________________________________________________________________________________________________________
res2c_branch2b (Conv2D)                   (None, None, None, 64)               36928         activation_8[0][0]         
________________________________________________________________________________________________________________________
bn2c_branch2b (BatchNormalization)        (None, None, None, 64)               256           res2c_branch2b[0][0]       
________________________________________________________________________________________________________________________
activation_9 (Activation)                 (None, None, None, 64)               0             bn2c_branch2b[0][0]        
________________________________________________________________________________________________________________________
res2c_branch2c (Conv2D)                   (None, None, None, 256)              16640         activation_9[0][0]         
________________________________________________________________________________________________________________________
bn2c_branch2c (BatchNormalization)        (None, None, None, 256)              1024          res2c_branch2c[0][0]       
________________________________________________________________________________________________________________________
add_3 (Add)                               (None, None, None, 256)              0             bn2c_branch2c[0][0]        
                                                                                             activation_7[0][0]         
________________________________________________________________________________________________________________________
activation_10 (Activation)                (None, None, None, 256)              0             add_3[0][0]                
________________________________________________________________________________________________________________________
res3a_branch2a (Conv2D)                   (None, None, None, 128)              32896         activation_10[0][0]        
________________________________________________________________________________________________________________________
bn3a_branch2a (BatchNormalization)        (None, None, None, 128)              512           res3a_branch2a[0][0]       
________________________________________________________________________________________________________________________
activation_11 (Activation)                (None, None, None, 128)              0             bn3a_branch2a[0][0]        
________________________________________________________________________________________________________________________
res3a_branch2b (Conv2D)                   (None, None, None, 128)              147584        activation_11[0][0]        
________________________________________________________________________________________________________________________
bn3a_branch2b (BatchNormalization)        (None, None, None, 128)              512           res3a_branch2b[0][0]       
________________________________________________________________________________________________________________________
activation_12 (Activation)                (None, None, None, 128)              0             bn3a_branch2b[0][0]        
________________________________________________________________________________________________________________________
res3a_branch2c (Conv2D)                   (None, None, None, 512)              66048         activation_12[0][0]        
________________________________________________________________________________________________________________________
res3a_branch1 (Conv2D)                    (None, None, None, 512)              131584        activation_10[0][0]        
________________________________________________________________________________________________________________________
bn3a_branch2c (BatchNormalization)        (None, None, None, 512)              2048          res3a_branch2c[0][0]       
________________________________________________________________________________________________________________________
bn3a_branch1 (BatchNormalization)         (None, None, None, 512)              2048          res3a_branch1[0][0]        
________________________________________________________________________________________________________________________
add_4 (Add)                               (None, None, None, 512)              0             bn3a_branch2c[0][0]        
                                                                                             bn3a_branch1[0][0]         
________________________________________________________________________________________________________________________
activation_13 (Activation)                (None, None, None, 512)              0             add_4[0][0]                
________________________________________________________________________________________________________________________
res3b_branch2a (Conv2D)                   (None, None, None, 128)              65664         activation_13[0][0]        
________________________________________________________________________________________________________________________
bn3b_branch2a (BatchNormalization)        (None, None, None, 128)              512           res3b_branch2a[0][0]       
________________________________________________________________________________________________________________________
activation_14 (Activation)                (None, None, None, 128)              0             bn3b_branch2a[0][0]        
________________________________________________________________________________________________________________________
res3b_branch2b (Conv2D)                   (None, None, None, 128)              147584        activation_14[0][0]        
________________________________________________________________________________________________________________________
bn3b_branch2b (BatchNormalization)        (None, None, None, 128)              512           res3b_branch2b[0][0]       
________________________________________________________________________________________________________________________
activation_15 (Activation)                (None, None, None, 128)              0             bn3b_branch2b[0][0]        
________________________________________________________________________________________________________________________
res3b_branch2c (Conv2D)                   (None, None, None, 512)              66048         activation_15[0][0]        
________________________________________________________________________________________________________________________
bn3b_branch2c (BatchNormalization)        (None, None, None, 512)              2048          res3b_branch2c[0][0]       
________________________________________________________________________________________________________________________
add_5 (Add)                               (None, None, None, 512)              0             bn3b_branch2c[0][0]        
                                                                                             activation_13[0][0]        
________________________________________________________________________________________________________________________
activation_16 (Activation)                (None, None, None, 512)              0             add_5[0][0]                
________________________________________________________________________________________________________________________
res3c_branch2a (Conv2D)                   (None, None, None, 128)              65664         activation_16[0][0]        
________________________________________________________________________________________________________________________
bn3c_branch2a (BatchNormalization)        (None, None, None, 128)              512           res3c_branch2a[0][0]       
________________________________________________________________________________________________________________________
activation_17 (Activation)                (None, None, None, 128)              0             bn3c_branch2a[0][0]        
________________________________________________________________________________________________________________________
res3c_branch2b (Conv2D)                   (None, None, None, 128)              147584        activation_17[0][0]        
________________________________________________________________________________________________________________________
bn3c_branch2b (BatchNormalization)        (None, None, None, 128)              512           res3c_branch2b[0][0]       
________________________________________________________________________________________________________________________
activation_18 (Activation)                (None, None, None, 128)              0             bn3c_branch2b[0][0]        
________________________________________________________________________________________________________________________
res3c_branch2c (Conv2D)                   (None, None, None, 512)              66048         activation_18[0][0]        
________________________________________________________________________________________________________________________
bn3c_branch2c (BatchNormalization)        (None, None, None, 512)              2048          res3c_branch2c[0][0]       
________________________________________________________________________________________________________________________
add_6 (Add)                               (None, None, None, 512)              0             bn3c_branch2c[0][0]        
                                                                                             activation_16[0][0]        
________________________________________________________________________________________________________________________
activation_19 (Activation)                (None, None, None, 512)              0             add_6[0][0]                
________________________________________________________________________________________________________________________
res3d_branch2a (Conv2D)                   (None, None, None, 128)              65664         activation_19[0][0]        
________________________________________________________________________________________________________________________
bn3d_branch2a (BatchNormalization)        (None, None, None, 128)              512           res3d_branch2a[0][0]       
________________________________________________________________________________________________________________________
activation_20 (Activation)                (None, None, None, 128)              0             bn3d_branch2a[0][0]        
________________________________________________________________________________________________________________________
res3d_branch2b (Conv2D)                   (None, None, None, 128)              147584        activation_20[0][0]        
________________________________________________________________________________________________________________________
bn3d_branch2b (BatchNormalization)        (None, None, None, 128)              512           res3d_branch2b[0][0]       
________________________________________________________________________________________________________________________
activation_21 (Activation)                (None, None, None, 128)              0             bn3d_branch2b[0][0]        
________________________________________________________________________________________________________________________
res3d_branch2c (Conv2D)                   (None, None, None, 512)              66048         activation_21[0][0]        
________________________________________________________________________________________________________________________
bn3d_branch2c (BatchNormalization)        (None, None, None, 512)              2048          res3d_branch2c[0][0]       
________________________________________________________________________________________________________________________
add_7 (Add)                               (None, None, None, 512)              0             bn3d_branch2c[0][0]        
                                                                                             activation_19[0][0]        
________________________________________________________________________________________________________________________
activation_22 (Activation)                (None, None, None, 512)              0             add_7[0][0]                
________________________________________________________________________________________________________________________
res4a_branch2a (Conv2D)                   (None, None, None, 256)              131328        activation_22[0][0]        
________________________________________________________________________________________________________________________
bn4a_branch2a (BatchNormalization)        (None, None, None, 256)              1024          res4a_branch2a[0][0]       
________________________________________________________________________________________________________________________
activation_23 (Activation)                (None, None, None, 256)              0             bn4a_branch2a[0][0]        
________________________________________________________________________________________________________________________
res4a_branch2b (Conv2D)                   (None, None, None, 256)              590080        activation_23[0][0]        
________________________________________________________________________________________________________________________
bn4a_branch2b (BatchNormalization)        (None, None, None, 256)              1024          res4a_branch2b[0][0]       
________________________________________________________________________________________________________________________
activation_24 (Activation)                (None, None, None, 256)              0             bn4a_branch2b[0][0]        
________________________________________________________________________________________________________________________
res4a_branch2c (Conv2D)                   (None, None, None, 1024)             263168        activation_24[0][0]        
________________________________________________________________________________________________________________________
res4a_branch1 (Conv2D)                    (None, None, None, 1024)             525312        activation_22[0][0]        
________________________________________________________________________________________________________________________
bn4a_branch2c (BatchNormalization)        (None, None, None, 1024)             4096          res4a_branch2c[0][0]       
________________________________________________________________________________________________________________________
bn4a_branch1 (BatchNormalization)         (None, None, None, 1024)             4096          res4a_branch1[0][0]        
________________________________________________________________________________________________________________________
add_8 (Add)                               (None, None, None, 1024)             0             bn4a_branch2c[0][0]        
                                                                                             bn4a_branch1[0][0]         
________________________________________________________________________________________________________________________
activation_25 (Activation)                (None, None, None, 1024)             0             add_8[0][0]                
________________________________________________________________________________________________________________________
res4b_branch2a (Conv2D)                   (None, None, None, 256)              262400        activation_25[0][0]        
________________________________________________________________________________________________________________________
bn4b_branch2a (BatchNormalization)        (None, None, None, 256)              1024          res4b_branch2a[0][0]       
________________________________________________________________________________________________________________________
activation_26 (Activation)                (None, None, None, 256)              0             bn4b_branch2a[0][0]        
________________________________________________________________________________________________________________________
res4b_branch2b (Conv2D)                   (None, None, None, 256)              590080        activation_26[0][0]        
________________________________________________________________________________________________________________________
bn4b_branch2b (BatchNormalization)        (None, None, None, 256)              1024          res4b_branch2b[0][0]       
________________________________________________________________________________________________________________________
activation_27 (Activation)                (None, None, None, 256)              0             bn4b_branch2b[0][0]        
________________________________________________________________________________________________________________________
res4b_branch2c (Conv2D)                   (None, None, None, 1024)             263168        activation_27[0][0]        
________________________________________________________________________________________________________________________
bn4b_branch2c (BatchNormalization)        (None, None, None, 1024)             4096          res4b_branch2c[0][0]       
________________________________________________________________________________________________________________________
add_9 (Add)                               (None, None, None, 1024)             0             bn4b_branch2c[0][0]        
                                                                                             activation_25[0][0]        
________________________________________________________________________________________________________________________
activation_28 (Activation)                (None, None, None, 1024)             0             add_9[0][0]                
________________________________________________________________________________________________________________________
res4c_branch2a (Conv2D)                   (None, None, None, 256)              262400        activation_28[0][0]        
________________________________________________________________________________________________________________________
bn4c_branch2a (BatchNormalization)        (None, None, None, 256)              1024          res4c_branch2a[0][0]       
________________________________________________________________________________________________________________________
activation_29 (Activation)                (None, None, None, 256)              0             bn4c_branch2a[0][0]        
________________________________________________________________________________________________________________________
res4c_branch2b (Conv2D)                   (None, None, None, 256)              590080        activation_29[0][0]        
________________________________________________________________________________________________________________________
bn4c_branch2b (BatchNormalization)        (None, None, None, 256)              1024          res4c_branch2b[0][0]       
________________________________________________________________________________________________________________________
activation_30 (Activation)                (None, None, None, 256)              0             bn4c_branch2b[0][0]        
________________________________________________________________________________________________________________________
res4c_branch2c (Conv2D)                   (None, None, None, 1024)             263168        activation_30[0][0]        
________________________________________________________________________________________________________________________
bn4c_branch2c (BatchNormalization)        (None, None, None, 1024)             4096          res4c_branch2c[0][0]       
________________________________________________________________________________________________________________________
add_10 (Add)                              (None, None, None, 1024)             0             bn4c_branch2c[0][0]        
                                                                                             activation_28[0][0]        
________________________________________________________________________________________________________________________
activation_31 (Activation)                (None, None, None, 1024)             0             add_10[0][0]               
________________________________________________________________________________________________________________________
res4d_branch2a (Conv2D)                   (None, None, None, 256)              262400        activation_31[0][0]        
________________________________________________________________________________________________________________________
bn4d_branch2a (BatchNormalization)        (None, None, None, 256)              1024          res4d_branch2a[0][0]       
________________________________________________________________________________________________________________________
activation_32 (Activation)                (None, None, None, 256)              0             bn4d_branch2a[0][0]        
________________________________________________________________________________________________________________________
res4d_branch2b (Conv2D)                   (None, None, None, 256)              590080        activation_32[0][0]        
________________________________________________________________________________________________________________________
bn4d_branch2b (BatchNormalization)        (None, None, None, 256)              1024          res4d_branch2b[0][0]       
________________________________________________________________________________________________________________________
activation_33 (Activation)                (None, None, None, 256)              0             bn4d_branch2b[0][0]        
________________________________________________________________________________________________________________________
res4d_branch2c (Conv2D)                   (None, None, None, 1024)             263168        activation_33[0][0]        
________________________________________________________________________________________________________________________
bn4d_branch2c (BatchNormalization)        (None, None, None, 1024)             4096          res4d_branch2c[0][0]       
________________________________________________________________________________________________________________________
add_11 (Add)                              (None, None, None, 1024)             0             bn4d_branch2c[0][0]        
                                                                                             activation_31[0][0]        
________________________________________________________________________________________________________________________
activation_34 (Activation)                (None, None, None, 1024)             0             add_11[0][0]               
________________________________________________________________________________________________________________________
res4e_branch2a (Conv2D)                   (None, None, None, 256)              262400        activation_34[0][0]        
________________________________________________________________________________________________________________________
bn4e_branch2a (BatchNormalization)        (None, None, None, 256)              1024          res4e_branch2a[0][0]       
________________________________________________________________________________________________________________________
activation_35 (Activation)                (None, None, None, 256)              0             bn4e_branch2a[0][0]        
________________________________________________________________________________________________________________________
res4e_branch2b (Conv2D)                   (None, None, None, 256)              590080        activation_35[0][0]        
________________________________________________________________________________________________________________________
bn4e_branch2b (BatchNormalization)        (None, None, None, 256)              1024          res4e_branch2b[0][0]       
________________________________________________________________________________________________________________________
activation_36 (Activation)                (None, None, None, 256)              0             bn4e_branch2b[0][0]        
________________________________________________________________________________________________________________________
res4e_branch2c (Conv2D)                   (None, None, None, 1024)             263168        activation_36[0][0]        
________________________________________________________________________________________________________________________
bn4e_branch2c (BatchNormalization)        (None, None, None, 1024)             4096          res4e_branch2c[0][0]       
________________________________________________________________________________________________________________________
add_12 (Add)                              (None, None, None, 1024)             0             bn4e_branch2c[0][0]        
                                                                                             activation_34[0][0]        
________________________________________________________________________________________________________________________
activation_37 (Activation)                (None, None, None, 1024)             0             add_12[0][0]               
________________________________________________________________________________________________________________________
res4f_branch2a (Conv2D)                   (None, None, None, 256)              262400        activation_37[0][0]        
________________________________________________________________________________________________________________________
bn4f_branch2a (BatchNormalization)        (None, None, None, 256)              1024          res4f_branch2a[0][0]       
________________________________________________________________________________________________________________________
activation_38 (Activation)                (None, None, None, 256)              0             bn4f_branch2a[0][0]        
________________________________________________________________________________________________________________________
res4f_branch2b (Conv2D)                   (None, None, None, 256)              590080        activation_38[0][0]        
________________________________________________________________________________________________________________________
bn4f_branch2b (BatchNormalization)        (None, None, None, 256)              1024          res4f_branch2b[0][0]       
________________________________________________________________________________________________________________________
activation_39 (Activation)                (None, None, None, 256)              0             bn4f_branch2b[0][0]        
________________________________________________________________________________________________________________________
res4f_branch2c (Conv2D)                   (None, None, None, 1024)             263168        activation_39[0][0]        
________________________________________________________________________________________________________________________
bn4f_branch2c (BatchNormalization)        (None, None, None, 1024)             4096          res4f_branch2c[0][0]       
________________________________________________________________________________________________________________________
add_13 (Add)                              (None, None, None, 1024)             0             bn4f_branch2c[0][0]        
                                                                                             activation_37[0][0]        
________________________________________________________________________________________________________________________
activation_40 (Activation)                (None, None, None, 1024)             0             add_13[0][0]               
________________________________________________________________________________________________________________________
input_2 (InputLayer)                      (None, None, 4)                      0                                        
________________________________________________________________________________________________________________________
roi_pooling_conv_1 (RoiPoolingConv)       (None, 32, 14, 14, 1024)             0             activation_40[0][0]        
                                                                                             input_2[0][0]              
________________________________________________________________________________________________________________________
res5a_branch2a (TimeDistributed)          (None, 32, 7, 7, 512)                524800        roi_pooling_conv_1[0][0]   
________________________________________________________________________________________________________________________
bn5a_branch2a (TimeDistributed)           (None, 32, 7, 7, 512)                2048          res5a_branch2a[0][0]       
________________________________________________________________________________________________________________________
activation_41 (Activation)                (None, 32, 7, 7, 512)                0             bn5a_branch2a[0][0]        
________________________________________________________________________________________________________________________
res5a_branch2b (TimeDistributed)          (None, 32, 7, 7, 512)                2359808       activation_41[0][0]        
________________________________________________________________________________________________________________________
bn5a_branch2b (TimeDistributed)           (None, 32, 7, 7, 512)                2048          res5a_branch2b[0][0]       
________________________________________________________________________________________________________________________
activation_42 (Activation)                (None, 32, 7, 7, 512)                0             bn5a_branch2b[0][0]        
________________________________________________________________________________________________________________________
res5a_branch2c (TimeDistributed)          (None, 32, 7, 7, 2048)               1050624       activation_42[0][0]        
________________________________________________________________________________________________________________________
res5a_branch1 (TimeDistributed)           (None, 32, 7, 7, 2048)               2099200       roi_pooling_conv_1[0][0]   
________________________________________________________________________________________________________________________
bn5a_branch2c (TimeDistributed)           (None, 32, 7, 7, 2048)               8192          res5a_branch2c[0][0]       
________________________________________________________________________________________________________________________
bn5a_branch1 (TimeDistributed)            (None, 32, 7, 7, 2048)               8192          res5a_branch1[0][0]        
________________________________________________________________________________________________________________________
add_14 (Add)                              (None, 32, 7, 7, 2048)               0             bn5a_branch2c[0][0]        
                                                                                             bn5a_branch1[0][0]         
________________________________________________________________________________________________________________________
activation_43 (Activation)                (None, 32, 7, 7, 2048)               0             add_14[0][0]               
________________________________________________________________________________________________________________________
res5b_branch2a (TimeDistributed)          (None, 32, 7, 7, 512)                1049088       activation_43[0][0]        
________________________________________________________________________________________________________________________
bn5b_branch2a (TimeDistributed)           (None, 32, 7, 7, 512)                2048          res5b_branch2a[0][0]       
________________________________________________________________________________________________________________________
activation_44 (Activation)                (None, 32, 7, 7, 512)                0             bn5b_branch2a[0][0]        
________________________________________________________________________________________________________________________
res5b_branch2b (TimeDistributed)          (None, 32, 7, 7, 512)                2359808       activation_44[0][0]        
________________________________________________________________________________________________________________________
bn5b_branch2b (TimeDistributed)           (None, 32, 7, 7, 512)                2048          res5b_branch2b[0][0]       
________________________________________________________________________________________________________________________
activation_45 (Activation)                (None, 32, 7, 7, 512)                0             bn5b_branch2b[0][0]        
________________________________________________________________________________________________________________________
res5b_branch2c (TimeDistributed)          (None, 32, 7, 7, 2048)               1050624       activation_45[0][0]        
________________________________________________________________________________________________________________________
bn5b_branch2c (TimeDistributed)           (None, 32, 7, 7, 2048)               8192          res5b_branch2c[0][0]       
________________________________________________________________________________________________________________________
add_15 (Add)                              (None, 32, 7, 7, 2048)               0             bn5b_branch2c[0][0]        
                                                                                             activation_43[0][0]        
________________________________________________________________________________________________________________________
activation_46 (Activation)                (None, 32, 7, 7, 2048)               0             add_15[0][0]               
________________________________________________________________________________________________________________________
res5c_branch2a (TimeDistributed)          (None, 32, 7, 7, 512)                1049088       activation_46[0][0]        
________________________________________________________________________________________________________________________
bn5c_branch2a (TimeDistributed)           (None, 32, 7, 7, 512)                2048          res5c_branch2a[0][0]       
________________________________________________________________________________________________________________________
activation_47 (Activation)                (None, 32, 7, 7, 512)                0             bn5c_branch2a[0][0]        
________________________________________________________________________________________________________________________
res5c_branch2b (TimeDistributed)          (None, 32, 7, 7, 512)                2359808       activation_47[0][0]        
________________________________________________________________________________________________________________________
bn5c_branch2b (TimeDistributed)           (None, 32, 7, 7, 512)                2048          res5c_branch2b[0][0]       
________________________________________________________________________________________________________________________
activation_48 (Activation)                (None, 32, 7, 7, 512)                0             bn5c_branch2b[0][0]        
________________________________________________________________________________________________________________________
res5c_branch2c (TimeDistributed)          (None, 32, 7, 7, 2048)               1050624       activation_48[0][0]        
________________________________________________________________________________________________________________________
bn5c_branch2c (TimeDistributed)           (None, 32, 7, 7, 2048)               8192          res5c_branch2c[0][0]       
________________________________________________________________________________________________________________________
add_16 (Add)                              (None, 32, 7, 7, 2048)               0             bn5c_branch2c[0][0]        
                                                                                             activation_46[0][0]        
________________________________________________________________________________________________________________________
activation_49 (Activation)                (None, 32, 7, 7, 2048)               0             add_16[0][0]               
________________________________________________________________________________________________________________________
rpn_conv1 (Conv2D)                        (None, None, None, 512)              4719104       activation_40[0][0]        
________________________________________________________________________________________________________________________
avg_pool (TimeDistributed)                (None, 32, 1, 1, 2048)               0             activation_49[0][0]        
________________________________________________________________________________________________________________________
rpn_out_class (Conv2D)                    (None, None, None, 9)                4617          rpn_conv1[0][0]            
________________________________________________________________________________________________________________________
rpn_out_regress (Conv2D)                  (None, None, None, 36)               18468         rpn_conv1[0][0]            
________________________________________________________________________________________________________________________
time_distributed_1 (TimeDistributed)      (None, 32, 2048)                     0             avg_pool[0][0]             
________________________________________________________________________________________________________________________
classification (Reshape)                  (None, None, 1)                      0             rpn_out_class[0][0]        
________________________________________________________________________________________________________________________
regression (Reshape)                      (None, None, 4)                      0             rpn_out_regress[0][0]      
________________________________________________________________________________________________________________________
dense_class_21 (TimeDistributed)          (None, 32, 21)                       43029         time_distributed_1[0][0]   
________________________________________________________________________________________________________________________
dense_regress_21 (TimeDistributed)        (None, 32, 80)                       163920        time_distributed_1[0][0]   
========================================================================================================================
Total params: 28,536,850
Trainable params: 28,483,730
Non-trainable params: 53,120
________________________________________________________________________________________________________________________
